// #1 Сгенерировать случайное число в заданном промежутке
const randomRange = (min = 0, max = 100) => Math.floor(Math.random() * (max - min) + min)
console.log('randomRange(0, 10)', randomRange(0, 10))

// #2 Сконвертировать RGB в Hex
const rgbToHex = (r, g, b) => "#" + ((1 << 24) + (r << 16) + (g << 8) + b).toString(16).slice(1)
console.log('rgbToHex(0, 60, 200)', rgbToHex(0, 60, 200)) // "#003cc8"

// #3 Перейти к верху страницы
// const goTop = () => window.scrollTo(0, 0)
// goTop()

// #4 Получить количество дней между двумя датами
const daysDiff = (d1, d2) => Math.ceil(Math.abs(d1.getTime() - d2.getTime()) / (3600 * 24 * 1000))
console.log(daysDiff(new Date("2021-10-10"), new Date("2022-01-01"))) // 83

// #5 Сгенерировать случайный цвет в Hex
const randomColor = () => `#${Math.floor(Math.random() * 0xffffff).toString(16).padEnd(6, "0")}`
console.log('randomColor', randomColor())


// #6 Проверить даты на выходной день
const isWeekday = date => date.getDay() % 6 !== 0
isWeekday(new Date("2021-10-11")) // true
console.log('isWeekday(new Date("2021-10-11"))', isWeekday(new Date("2021-10-11")))

// #7 Обрезать теги HTML d тексте
// const stripHtml = input => (new DOMParser().parseFromString(html, 'text/html')).body.textContent || ''
// stripHtml('<h3>Текст с тегами</h3>') // "Текст с тегами"

// #8 Скрыть и показать элемент
// const toggleDisplay = el => el.style.display = (el.style.display === "none" ? "block" : "none")

// #9 Сделать строку с заглавной буквы
const capitalize = str => str.charAt(0).toUpperCase() + str.slice(1)
console.log(capitalize("надеемся Вам нравятся наши карточки"))

// #10 Случайно перемешать элементы в массиве
const arrayShuffle = (arr) => arr.sort(() => 0.5 - Math.random())
arrayShuffle([1, 3, 5, 7, 10]) // [10, 5, 1, 3, 7]
console.log('arrayShuffle([1, 3, 5, 7, 10])', arrayShuffle([1, 3, 5, 7, 10]))

// #11 Получить среднее арифметическое числового массива
const avg = arr => arr.reduce((a, b) => a + b) / arr.length
avg([1, 3, 8, 10]) // 5.5
console.log('avg([1, 3, 8, 10])', avg([1, 3, 8, 10]))

// #12 Выбрать случайный элемент из массива
const getRandomItem = arr => arr[Math.floor(Math.random() * arr.length)]
getRandomItem(['☀️', '☁️', '⛈️', '🌧️', '🌤️']) // '🌤️'
console.log(getRandomItem(['☀️', '☁️', '⛈️', '🌧️', '🌤️']))

//  #13 Приведение значений к логическому типу
const myBoolean = !!myVariable

/*
Двойное отрицание(!!) нужно для того, чтобы значение, являющееся с точки зрения правил JavaScript истинным, было бы преобразовано в true, а ложным — в false.
*/

// #14 Избавление от повторяющихся значений в массивах
const deDupe = [...new Set(myArray)]

/*
Структуры данных типа Set хранят лишь уникальные значения.В результате использование такой структуры данных и синтаксиса spread позволяет создать на основе массива myArray новый массив, в котором нет повторяющихся значений.
*/

// #15  Создание и установка свойств объектов по условию
const myObject = { ...myProperty && { propName: myProperty } }

/*
Если в результате вычисления левой части выражения будет получено нечто, воспринимаемое JS как ложное значение, то && не будет проводить дальнейшие вычисления и новое свойство не будет создано и установлено.Объект myObject будет пустым.Если же конструкция ...myProperty вернёт какой - то результат, воспринимаемый JS как истинный, благодаря конструкции && в объекте появится свойство propName, хранящее полученное значение.
*/

// #16 Слияние объектов
const mergedObject = { ...objectOne, ...objectTwo }

/*
Этот подход можно использовать для организации слияния неограниченного числа объектов.При этом если у объектов будут свойства с одинаковыми именами, в итоговом объекте останется лишь одно такое свойство, принадлежащее тому из исходных объектов, который расположен правее других.Обратите внимание на то, что здесь используется мелкое копирование свойств объектов.
*/

// #17 Обмен значений переменных
[varA, varB] = [varB, varA]

/*
После этого то, что было в varA, попадёт в varB, и наоборот.Это возможно благодаря использованию внутренних механизмов деструктурирования.
*/

// #18  Удаление ложных значений из массива
const clean = dirty.filter(Boolean)

/*
В ходе выполнения этой операции из массива будут удалены такие значения, как null, undefined, false, 0, а так же пустые строки.
*/

// #19 Преобразование чисел в массиве в строки и наоборот
const stringArray = numberArray.map(String)
const numberArray = stringArray.map(Number)

/*
Строковые элементы массива в ходе подобного преобразования так и останутся строковыми
и наоборот
*/

// #20 Извлечение значений свойств объектов

const { original: newName } = myObject

/*
Вот как можно извлечь значение свойства объекта и записать его в константу, имя которой отличается от имени этого свойства.
Благодаря использованию этой конструкции будет создана новая константа, newName, в которую будет записано значение свойства original объекта myObject.
*/

// #21 Форматирование JSON-кода

const formatted = JSON.stringify(myObj, null, 2)

/*
Вот как можно преобразовать JSON - код к виду, удобному для восприятия.
Метод stringify принимает три параметра.Первый — это JavaScript - объект. Второй, необязательный, представляет собой функцию, которую можно использовать для обработки JSON-кода, получающегося в ходе преобразования объекта. Последний параметр указывает на то, сколько пробелов нужно использовать при формировании отступов в JSON-коде.Если опустить последний параметр, то весь полученный JSON-код будет представлять собой одну длинную строку.Если в объекте myObj есть циклические ссылки, преобразовать его в формат JSON не удастся.
*/

// #22 Быстрое создание числовых массивов
const numArray = Array.from(new Array(52), (x, i) => i)

/*
Первый элемент такого массива имеет индекс 0. Размер массива можно задавать как с помощью числового литерала, так и с помощью переменной. Здесь мы создаём массив из 52 элементов, который, например, можно использовать для хранения данных о колоде карт.
*/

// #23 Создание кодов для двухфакторной аутентификации
const code = Math.floor(Math.random() * 1000000).toString().padStart(6, "0");

/*
Генерация шестизначного кода, используемого в механизмах двухфакторной аутентификации или в других подобных.
Обратите внимание на то, что количество нулей в числе, на которое умножается результат, возвращаемый Math.random(), должно соответствовать первому параметру(targetLength) метода padStart.
*/

// #24 Создание глубоких копий объектов

const myClone = JSON.parse(JSON.stringify(originalObject))

/*
Предлагаемый здесь метод глубокого копирования объектов не отличается особенно высокой производительностью. Но если нужно решить эту задачу с использованием однострочника — можно воспользоваться этим кодом.
Надо отметить, что если в originalObject есть циклические ссылки, то создать его копию не удастся. Эту технику рекомендуется использовать на простых объектах, которые вы создаёте сами.
*/

// #25 Создание мелкой копии объекта с помощью синтаксиса spread
const myClone = { ...orignalObject }